#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.azurerm_dns_zone.badbort will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_dns_zone" "badbort" {
      + id                        = (known after apply)
      + max_number_of_record_sets = (known after apply)
      + name                      = "badbort.com"
      + name_servers              = (known after apply)
      + number_of_record_sets     = (known after apply)
      + resource_group_name       = "rg-backstage"
      + tags                      = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # azurerm_container_group.cg will be created
  + resource "azurerm_container_group" "cg" {
      + dns_name_label      = "bortacusmaximus"
      + exposed_port        = (known after apply)
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + ip_address          = (known after apply)
      + ip_address_type     = "Public"
      + location            = "australiaeast"
      + name                = "mycontainer"
      + os_type             = "Linux"
      + resource_group_name = "rg-backstage"
      + restart_policy      = "Always"

      + container {
          + commands = (known after apply)
          + cpu      = 0.5
          + image    = "registry.hub.docker.com/yeasy/simple-web:latest"
          + memory   = 1
          + name     = "testsite"

          + ports {
              + port     = 80
              + protocol = "TCP"
            }
        }
    }

  # azurerm_dns_cname_record.example will be created
  + resource "azurerm_dns_cname_record" "example" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "www"
      + record              = (known after apply)
      + resource_group_name = "rg-backstage"
      + ttl                 = 300
      + zone_name           = "badbort.com"
    }

  # azurerm_resource_group.rg_backstage will be created
  + resource "azurerm_resource_group" "rg_backstage" {
      + id       = (known after apply)
      + location = "australiaeast"
      + name     = "rg-backstage"
      + tags     = {
          + "environment" = "dev"
          + "project"     = "project-alpha"
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @badbort, Action: `pull_request`, Working Directory: ``, Workflow: `.github/workflows/deploy.yml`*